artillery/random_user_tests.yaml
config:
  #target: "https://tukano-scc-61052.azurewebsites.net/rest" 
  target: "http://127.0.0.1:8080/tukano/rest" 
  plugins:
    metrics-by-endpoint: {}        # Enables per-endpoint metrics aggregation
  phases:
  - name: "Warm up"    # WARM UP PHASE: duration: 10s, starting with 1 new client/sec up to 5 new clients/sec
    duration: 10
    arrivalRate: 1
    rampTo: 5
  - name: "Main test"  
    duration: 30
    arrivalRate: 10
  processor: "./helpers.js"         # Path to the JavaScript helper file
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:

  - name: "Create a new user"
   # weight: 1
    flow:
      - post:
          url: "/users/"
          beforeRequest: "uploadRandomizedUser"
          afterResponse: "processRegisterReply"

  - name: "Get a user by userId and password"
    #weight: 1
    flow:
      - get:
          url: "/users/{{ userId }}?pwd={{ pwd }}"
          beforeRequest: "prepareGetUser"

  - name: "Update a user by userId and password"
    flow:
      - put:
          url: "/users/{{ userId }}?pwd={{ pwd }}"
          beforeRequest: "prepareUpdateUser"
          afterResponse: "processUpdateReply"

  - name: "Delete a user by userId and password"
   # weight: 50
    flow:
      - delete:
          url: "/users/{{ userId }}?pwd={{ pwd }}"
          beforeRequest: "prepareDeleteUser"

  - name: "Search users by query pattern"
    flow:
      - get:
          url: "/users?query={{ queryPattern }}"
          beforeRequest: "prepareSearchPattern"