artillery/user_tests.yaml
config:
  target: "https://tukano-scc-61052.azurewebsites.net/rest" 
  plugins:
    metrics-by-endpoint: {}        # Enables per-endpoint metrics aggregation
  phases:
  - name: "Warm up"    # WARM UP PHASE: duration: 10s, starting with 1 new client/sec up to 5 new clients/sec
    duration: 10
    arrivalRate: 1
    rampTo: 5
  - name: "Main test"  
    duration: 60
    arrivalRate: 5
  processor: "./helpers.js"         # Path to the JavaScript helper file
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create a new randomized user"
    flow:
      - function: "uploadRandomizedUser"    # Registers a randomized user
      - post:
          url: "/users"
          body: "{{ $loopback }}"          # Using randomized user from helper function
          capture:
            - json: "$.userId"
              as: "userId"
            - json: "$.pwd"
              as: "pwd"
      - function: "processRegisterReply"    # Processes registration response

  - name: "Get user by ID with password"
    flow:
      - function: "prepareGetUser"          # Sets userId and pwd in URL
      - get:
          url: "/users/{{ userId }}"
          qs:
            pwd: "{{ pwd }}"

  - name: "Update a user by ID with password"
    flow:
      - put:
          url: "/users/{{ userId }}"
          qs:
            pwd: "{{ pwd }}"
          json:
            userId: "{{ userId }}"
            name: "Updated Test User"
            password: "newTestPassword"

  - name: "Delete a user by ID with password"
    flow:
      - delete:
          url: "/users/{{ userId }}"
          qs:
            pwd: "{{ pwd }}"

  - name: "Search users by pattern"
    flow:
      - get:
          url: "/users"
          qs:
            query: "test"