artillery/user_tests.yaml
config:
  target: "https://tukano-scc-61052.azurewebsites.net/rest" 
  plugins:
    metrics-by-endpoint: {}        # Enables per-endpoint metrics aggregation
  phases:
  - name: "Warm up"    # WARM UP PHASE: duration: 10s, starting with 1 new client/sec up to 5 new clients/sec
    duration: 10
    arrivalRate: 1
    rampTo: 5
  - name: "Main test"  
    duration: 60
    arrivalRate: 5
  processor: "./helpers.js"         # Path to the JavaScript helper file
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create a new user"
    flow:
      - post:
          url: "/users/"
          beforeRequest: "uploadRandomizedUser"
          afterResponse: "processRegisterReply"
      - log: "User created with ID: {{ userId }}"

  - name: "Get a user by userId and password"
    flow:
      - get:
          url: "/users/{{ userId }}"
          qs:
            pwd: "{{ pwd }}"
          beforeRequest: "prepareGetUser"
      - log: "Retrieved user with ID: {{ userId }}"

  - name: "Update a user by userId and password"
    flow:
      - put:
          url: "/users/{{ userId }}"
          qs:
            pwd: "{{ pwd }}"
          beforeRequest: "prepareUpdateUser"
          afterResponse: "processUpdateReply"
      - log: "Updated user with ID: {{ userId }}"

  - name: "Delete a user by userId and password"
    flow:
      - delete:
          url: "/users/{{ userId }}"
          qs:
            pwd: "{{ pwd }}"
          beforeRequest: "prepareDeleteUser"
      - log: "Deleted user with ID: {{ userId }}"

  - name: "Search users by query pattern"
    flow:
      - get:
          url: "/users"
          qs:
            query: "{{ queryPattern }}"
          beforeRequest: "prepareSearchPattern"
      - log: "Searched users with pattern: {{ queryPattern }}"